#include "main.h"

flagCoordinate flagCoordinate[2][9] = {{{289, 387, 1080}, {289, 387, 724}, {289, 387, 369}, {190, 1681, 1080}, {190, 1681, 724}, {190, 1681, 369}, {289, 3112, 1080}, {289, 3112, 724}, {289, 3112, 369}},                                                                          //普通自动赛坐标
                                       {{289, 387, 1080}, {289, 387, 724}, {289, 387, 369}, {289, 387 + 2 * MAT_SIZE, 1080}, {289, 2 * MAT_SIZE, 724}, {289, 2 * MAT_SIZE, 369}, {289, 387 + 4 * MAT_SIZE, 1080}, {289, 387 + 4 * MAT_SIZE, 724}, {289, 387 + 4 * MAT_SIZE, 369}}}; //纯自动旗子坐标

//盘子的坐标 红方基准
capCoordinate capCoordinate[8] = {{889, 889}, {889, SITE_SIZE - 889}, //第一组两个靠近网 0和1
                                  {1488, 1433},
                                  {1488, SITE_SIZE - 1433}, //第二组 2 和 3
                                  {2685, 1433},
                                  {2685, SITE_SIZE - 1433}, //第三组 4 和5
                                  {3283, 1433},
                                  {3283, SITE_SIZE - 1433}}; //第四组 6 和 7 靠近后场围板
